Revit 2025 API
CircuitNumberingOption Enumeration
 An enumerated type listing all the circuit numbering options.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum CircuitNumberingOption
Public Enumeration CircuitNumberingOption
public enum class CircuitNumberingOption
type CircuitNumberingOption
Members
Member name | Value | Description
Default | 0 |  Circuit numbering type is starting from one.
Continuous | 1 |  Circuit numbering type is continuous from its parent panel.
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace